[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # local_file.jx-requirements[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "local_file" "jx-requirements" {
      [32m+[0m [0m[1m[0mcontent[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mdirectory_permission[0m[0m = "0777"
      [32m+[0m [0m[1m[0mfile_permission[0m[0m      = "0777"
      [32m+[0m [0m[1m[0mfilename[0m[0m             = "./jx-requirements.yaml"
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
    }

[1m  # module.jx.google_project_service.cloudbuild_api[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_service" "cloudbuild_api" {
      [32m+[0m [0m[1m[0mdisable_on_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m            = "terraform-test"
      [32m+[0m [0m[1m[0mservice[0m[0m            = "cloudbuild.googleapis.com"
    }

[1m  # module.jx.google_project_service.cloudresourcemanager_api[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_service" "cloudresourcemanager_api" {
      [32m+[0m [0m[1m[0mdisable_on_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m            = "terraform-test"
      [32m+[0m [0m[1m[0mservice[0m[0m            = "cloudresourcemanager.googleapis.com"
    }

[1m  # module.jx.google_project_service.compute_api[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_service" "compute_api" {
      [32m+[0m [0m[1m[0mdisable_on_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m            = "terraform-test"
      [32m+[0m [0m[1m[0mservice[0m[0m            = "compute.googleapis.com"
    }

[1m  # module.jx.google_project_service.containeranalysis_api[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_service" "containeranalysis_api" {
      [32m+[0m [0m[1m[0mdisable_on_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m            = "terraform-test"
      [32m+[0m [0m[1m[0mservice[0m[0m            = "containeranalysis.googleapis.com"
    }

[1m  # module.jx.google_project_service.containerregistry_api[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_service" "containerregistry_api" {
      [32m+[0m [0m[1m[0mdisable_on_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m            = "terraform-test"
      [32m+[0m [0m[1m[0mservice[0m[0m            = "containerregistry.googleapis.com"
    }

[1m  # module.jx.google_project_service.iam_api[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_service" "iam_api" {
      [32m+[0m [0m[1m[0mdisable_on_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m            = "terraform-test"
      [32m+[0m [0m[1m[0mservice[0m[0m            = "iam.googleapis.com"
    }

[1m  # module.jx.module.backup.google_project_iam_member.velero_sa_storage_admin_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_iam_member" "velero_sa_storage_admin_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/storage.admin"
    }

[1m  # module.jx.module.backup.google_project_iam_member.velero_sa_storage_object_admin_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_iam_member" "velero_sa_storage_object_admin_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/storage.objectAdmin"
    }

[1m  # module.jx.module.backup.google_project_iam_member.velero_sa_storage_object_creator_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_iam_member" "velero_sa_storage_object_creator_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/storage.objectCreator"
    }

[1m  # module.jx.module.backup.google_service_account.velero_sa[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_service_account" "velero_sa" {
      [32m+[0m [0m[1m[0maccount_id[0m[0m   = "test-cluster-velero"
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m = "Velero service account for test-cluster"
      [32m+[0m [0m[1m[0memail[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0munique_id[0m[0m    = (known after apply)
    }

[1m  # module.jx.module.backup.google_storage_bucket.backup_bucket[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_storage_bucket" "backup_bucket" {
      [32m+[0m [0m[1m[0mbucket_policy_only[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m      = true
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m           = "US"
      [32m+[0m [0m[1m[0mname[0m[0m               = "terraform-test-backup"
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mstorage_class[0m[0m      = "STANDARD"
      [32m+[0m [0m[1m[0murl[0m[0m                = (known after apply)
    }

[1m  # module.jx.module.cluster.google_container_cluster.jx_cluster[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_container_cluster" "jx_cluster" {
      [32m+[0m [0m[1m[0mcluster_ipv4_cidr[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdefault_max_pods_per_node[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m                 = "jx k8s cluster"
      [32m+[0m [0m[1m[0menable_binary_authorization[0m[0m = false
      [32m+[0m [0m[1m[0menable_intranode_visibility[0m[0m = false
      [32m+[0m [0m[1m[0menable_kubernetes_alpha[0m[0m     = false
      [32m+[0m [0m[1m[0menable_legacy_abac[0m[0m          = true
      [32m+[0m [0m[1m[0menable_shielded_nodes[0m[0m       = false
      [32m+[0m [0m[1m[0menable_tpu[0m[0m                  = false
      [32m+[0m [0m[1m[0mendpoint[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0minitial_node_count[0m[0m          = 3
      [32m+[0m [0m[1m[0minstance_group_urls[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "europe-west1-b"
      [32m+[0m [0m[1m[0mlogging_service[0m[0m             = "logging.googleapis.com/kubernetes"
      [32m+[0m [0m[1m[0mmaster_version[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mmonitoring_service[0m[0m          = "monitoring.googleapis.com/kubernetes"
      [32m+[0m [0m[1m[0mname[0m[0m                        = "test-cluster"
      [32m+[0m [0m[1m[0mnetwork[0m[0m                     = "default"
      [32m+[0m [0m[1m[0mnode_locations[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mnode_version[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mresource_labels[0m[0m             = {
          [32m+[0m [0m"type" = ""
        }
      [32m+[0m [0m[1m[0mservices_ipv4_cidr[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mtpu_ipv4_cidr_block[0m[0m         = (known after apply)

      [32m+[0m [0maddons_config {
          [32m+[0m [0mcloudrun_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mhorizontal_pod_autoscaling {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mhttp_load_balancing {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mistio_config {
              [32m+[0m [0m[1m[0mauth[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mkubernetes_dashboard {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mnetwork_policy_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mauthenticator_groups_config {
          [32m+[0m [0m[1m[0msecurity_group[0m[0m = (known after apply)
        }

      [32m+[0m [0mcluster_autoscaling {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)

          [32m+[0m [0mauto_provisioning_defaults {
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mservice_account[0m[0m = (known after apply)
            }

          [32m+[0m [0mresource_limits {
              [32m+[0m [0m[1m[0mmaximum[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mminimum[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mresource_type[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mdatabase_encryption {
          [32m+[0m [0m[1m[0mkey_name[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mstate[0m[0m    = (known after apply)
        }

      [32m+[0m [0mmaintenance_policy {
          [32m+[0m [0mdaily_maintenance_window {
              [32m+[0m [0m[1m[0mduration[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mstart_time[0m[0m = "03:00"
            }
        }

      [32m+[0m [0mmaster_auth {
          [32m+[0m [0m[1m[0mclient_certificate[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mclient_key[0m[0m             = (sensitive value)
          [32m+[0m [0m[1m[0mcluster_ca_certificate[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mpassword[0m[0m               = (sensitive value)
          [32m+[0m [0m[1m[0musername[0m[0m               = (known after apply)

          [32m+[0m [0mclient_certificate_config {
              [32m+[0m [0m[1m[0missue_client_certificate[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnetwork_policy {
          [32m+[0m [0m[1m[0menabled[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mprovider[0m[0m = (known after apply)
        }

      [32m+[0m [0mnode_config {
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m      = 100
          [32m+[0m [0m[1m[0mdisk_type[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mguest_accelerator[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mimage_type[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mlabels[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmachine_type[0m[0m      = "n1-standard-2"
          [32m+[0m [0m[1m[0mmetadata[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = [
              [32m+[0m [0m"https://www.googleapis.com/auth/cloud-platform",
              [32m+[0m [0m"https://www.googleapis.com/auth/compute",
              [32m+[0m [0m"https://www.googleapis.com/auth/devstorage.full_control",
              [32m+[0m [0m"https://www.googleapis.com/auth/logging.write",
              [32m+[0m [0m"https://www.googleapis.com/auth/monitoring",
              [32m+[0m [0m"https://www.googleapis.com/auth/service.management",
              [32m+[0m [0m"https://www.googleapis.com/auth/servicecontrol",
            ]
          [32m+[0m [0m[1m[0mpreemptible[0m[0m       = false
          [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mtaint[0m[0m             = (known after apply)

          [32m+[0m [0mshielded_instance_config {
              [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
            }
        }

      [32m+[0m [0mnode_pool {
          [32m+[0m [0m[1m[0minitial_node_count[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0minstance_group_urls[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_pods_per_node[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mname_prefix[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mnode_count[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnode_locations[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mversion[0m[0m             = (known after apply)

          [32m+[0m [0mautoscaling {
              [32m+[0m [0m[1m[0mmax_node_count[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mmin_node_count[0m[0m = (known after apply)
            }

          [32m+[0m [0mmanagement {
              [32m+[0m [0m[1m[0mauto_repair[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0mauto_upgrade[0m[0m = (known after apply)
            }

          [32m+[0m [0mnode_config {
              [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mdisk_type[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mguest_accelerator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mimage_type[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0mlabels[0m[0m            = (known after apply)
              [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mmachine_type[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mmetadata[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mpreemptible[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mtags[0m[0m              = (known after apply)
              [32m+[0m [0m[1m[0mtaint[0m[0m             = (known after apply)

              [32m+[0m [0msandbox_config {
                  [32m+[0m [0m[1m[0msandbox_type[0m[0m = (known after apply)
                }

              [32m+[0m [0mshielded_instance_config {
                  [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
                }

              [32m+[0m [0mworkload_metadata_config {
                  [32m+[0m [0m[1m[0mnode_metadata[0m[0m = (known after apply)
                }
            }

          [32m+[0m [0mupgrade_settings {
              [32m+[0m [0m[1m[0mmax_surge[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mmax_unavailable[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mrelease_channel {
          [32m+[0m [0m[1m[0mchannel[0m[0m = (known after apply)
        }

      [32m+[0m [0mworkload_identity_config {
          [32m+[0m [0m[1m[0midentity_namespace[0m[0m = "terraform-test.svc.id.goog"
        }
    }

[1m  # module.jx.module.cluster.google_project_iam_member.jxboot_sa_dns_admin_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_iam_member" "jxboot_sa_dns_admin_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/dns.admin"
    }

[1m  # module.jx.module.cluster.google_project_iam_member.jxboot_sa_project_viewer_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_iam_member" "jxboot_sa_project_viewer_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/viewer"
    }

[1m  # module.jx.module.cluster.google_project_iam_member.jxboot_sa_service_account_key_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_iam_member" "jxboot_sa_service_account_key_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/iam.serviceAccountKeyAdmin"
    }

[1m  # module.jx.module.cluster.google_project_iam_member.jxboot_sa_storage_admin_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_iam_member" "jxboot_sa_storage_admin_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/storage.admin"
    }

[1m  # module.jx.module.cluster.google_project_iam_member.kaniko_sa_storage_admin_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_iam_member" "kaniko_sa_storage_admin_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/storage.admin"
    }

[1m  # module.jx.module.cluster.google_project_iam_member.kaniko_sa_storage_object_admin_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_iam_member" "kaniko_sa_storage_object_admin_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/storage.objectAdmin"
    }

[1m  # module.jx.module.cluster.google_project_iam_member.kaniko_sa_storage_object_creator_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_iam_member" "kaniko_sa_storage_object_creator_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/storage.objectCreator"
    }

[1m  # module.jx.module.cluster.google_service_account.jxboot_sa[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_service_account" "jxboot_sa" {
      [32m+[0m [0m[1m[0maccount_id[0m[0m   = "test-cluster-jb"
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m = "jx-boot service account for test-cluster"
      [32m+[0m [0m[1m[0memail[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0munique_id[0m[0m    = (known after apply)
    }

[1m  # module.jx.module.cluster.google_service_account.kaniko_sa[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_service_account" "kaniko_sa" {
      [32m+[0m [0m[1m[0maccount_id[0m[0m   = "test-cluster-ko"
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m = "Kaniko service account for test-cluster"
      [32m+[0m [0m[1m[0memail[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0munique_id[0m[0m    = (known after apply)
    }

[1m  # module.jx.module.cluster.google_service_account.storage_sa[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_service_account" "storage_sa" {
      [32m+[0m [0m[1m[0maccount_id[0m[0m   = "test-cluster-st"
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m = "Storage service account for test-cluster"
      [32m+[0m [0m[1m[0memail[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0munique_id[0m[0m    = (known after apply)
    }

[1m  # module.jx.module.cluster.google_service_account_iam_binding.jxboot_sa_workload_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_service_account_iam_binding" "jxboot_sa_workload_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mmembers[0m[0m            = [
          [32m+[0m [0m"serviceAccount:terraform-test.svc.id.goog[jx/test-cluster-jb]",
        ]
      [32m+[0m [0m[1m[0mrole[0m[0m               = "roles/iam.workloadIdentityUser"
      [32m+[0m [0m[1m[0mservice_account_id[0m[0m = (known after apply)
    }

[1m  # module.jx.module.cluster.google_service_account_iam_binding.kaniko_sa_workload_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_service_account_iam_binding" "kaniko_sa_workload_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mmembers[0m[0m            = [
          [32m+[0m [0m"serviceAccount:terraform-test.svc.id.goog[jx/test-cluster-ko]",
        ]
      [32m+[0m [0m[1m[0mrole[0m[0m               = "roles/iam.workloadIdentityUser"
      [32m+[0m [0m[1m[0mservice_account_id[0m[0m = (known after apply)
    }

[1m  # module.jx.module.cluster.google_storage_bucket.lts_bucket[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_storage_bucket" "lts_bucket" {
      [32m+[0m [0m[1m[0mbucket_policy_only[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m      = true
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m           = "US"
      [32m+[0m [0m[1m[0mname[0m[0m               = "terraform-test-lts"
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mstorage_class[0m[0m      = "STANDARD"
      [32m+[0m [0m[1m[0murl[0m[0m                = (known after apply)
    }

[1m  # module.jx.module.dns.google_project_iam_member.externaldns_sa_dns_admin_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_iam_member" "externaldns_sa_dns_admin_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/dns.admin"
    }

[1m  # module.jx.module.dns.google_project_service.dns_api[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_service" "dns_api" {
      [32m+[0m [0m[1m[0mdisable_on_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m            = "terraform-test"
      [32m+[0m [0m[1m[0mservice[0m[0m            = "dns.googleapis.com"
    }

[1m  # module.jx.module.dns.google_service_account.externaldns_sa[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_service_account" "externaldns_sa" {
      [32m+[0m [0m[1m[0maccount_id[0m[0m   = "test-cluster-dn"
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m = "ExternalDNS service account for test-cluster"
      [32m+[0m [0m[1m[0memail[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0munique_id[0m[0m    = (known after apply)
    }

[1m  # module.jx.module.dns.google_service_account_iam_binding.externaldns_sa_workload_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_service_account_iam_binding" "externaldns_sa_workload_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mmembers[0m[0m            = [
          [32m+[0m [0m"serviceAccount:terraform-test.svc.id.goog[jx/test-cluster-dn]",
        ]
      [32m+[0m [0m[1m[0mrole[0m[0m               = "roles/iam.workloadIdentityUser"
      [32m+[0m [0m[1m[0mservice_account_id[0m[0m = (known after apply)
    }

[1m  # module.jx.module.vault.google_kms_crypto_key.vault_crypto_key[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_kms_crypto_key" "vault_crypto_key" {
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mkey_ring[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m            = "test-cluster-crypto-key"
      [32m+[0m [0m[1m[0mpurpose[0m[0m         = "ENCRYPT_DECRYPT"
      [32m+[0m [0m[1m[0mrotation_period[0m[0m = "100000s"
      [32m+[0m [0m[1m[0mself_link[0m[0m       = (known after apply)

      [32m+[0m [0mversion_template {
          [32m+[0m [0m[1m[0malgorithm[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mprotection_level[0m[0m = (known after apply)
        }
    }

[1m  # module.jx.module.vault.google_kms_key_ring.vault_keyring[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_kms_key_ring" "vault_keyring" {
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m  = "global"
      [32m+[0m [0m[1m[0mname[0m[0m      = "test-cluster-keyring"
      [32m+[0m [0m[1m[0mproject[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m = (known after apply)
    }

[1m  # module.jx.module.vault.google_project_iam_member.vault_sa_cloudkms_admin_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_iam_member" "vault_sa_cloudkms_admin_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/cloudkms.admin"
    }

[1m  # module.jx.module.vault.google_project_iam_member.vault_sa_cloudkms_crypto_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_iam_member" "vault_sa_cloudkms_crypto_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

[1m  # module.jx.module.vault.google_project_iam_member.vault_sa_storage_object_admin_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_iam_member" "vault_sa_storage_object_admin_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/storage.objectAdmin"
    }

[1m  # module.jx.module.vault.google_project_service.cloudkms_api[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_project_service" "cloudkms_api" {
      [32m+[0m [0m[1m[0mdisable_on_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m            = "terraform-test"
      [32m+[0m [0m[1m[0mservice[0m[0m            = "cloudkms.googleapis.com"
    }

[1m  # module.jx.module.vault.google_service_account.vault_sa[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_service_account" "vault_sa" {
      [32m+[0m [0m[1m[0maccount_id[0m[0m   = "test-cluster-vt"
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m = "Vault service account for test-cluster"
      [32m+[0m [0m[1m[0memail[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0munique_id[0m[0m    = (known after apply)
    }

[1m  # module.jx.module.vault.google_service_account_iam_binding.vault_sa_workload_binding[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_service_account_iam_binding" "vault_sa_workload_binding" {
      [32m+[0m [0m[1m[0metag[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mmembers[0m[0m            = [
          [32m+[0m [0m"serviceAccount:terraform-test.svc.id.goog[jx/test-cluster-vt]",
        ]
      [32m+[0m [0m[1m[0mrole[0m[0m               = "roles/iam.workloadIdentityUser"
      [32m+[0m [0m[1m[0mservice_account_id[0m[0m = (known after apply)
    }

[1m  # module.jx.module.vault.google_storage_bucket.vault_bucket[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "google_storage_bucket" "vault_bucket" {
      [32m+[0m [0m[1m[0mbucket_policy_only[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m      = true
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m           = "US"
      [32m+[0m [0m[1m[0mname[0m[0m               = "terraform-test-vault"
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mstorage_class[0m[0m      = "STANDARD"
      [32m+[0m [0m[1m[0murl[0m[0m                = (known after apply)
    }

[0m[1mPlan:[0m 39 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.